[
  {
    "title": "Software Engineer L2",
    "company": "OY! Indonesia",
    "location": "Jakarta",
    "period": "August 2023 - Present",
    "icon": "/oy.svg",
    "description": [
      "Boosted backlog insertion throughput by over 2800% by optimizing data retrieval and implementing a parallel processing architecture.",
      "Streamlined RabbitMQ operations, reducing CPU utilization by 20% and message count by 66% through an innovative delayed publisher mechanism on QRIS Auto Cancel Mechanism.",
      "Decreased settlement callback latency by combining bulk processing and caching mechanisms, resulting in a 27.31% improvement and significantly enhancing the 95th percentile for faster data retrieval.",
      "Optimized backlog settlement by implementing a separation of 'hot' and 'cold' data tables for critical data, resulting in a 60% improvement in data retrieval latency and a 93% enhancement in performance."
    ]
  },
  {
    "title": "Software Engineer L1",
    "company": "OY! Indonesia",
    "location": "Jakarta",
    "period": "August 2022 - August 2023",
    "icon": "/oy.svg",
    "description": [
      "Led cross-team collaboration on advanced search optimization, achieving a 96.97% reduction in acceptance dashboard load time and a 99.71% decrease in 95th percentile latency.",
      "Spearheaded the table partitioning initiative for the settlement table, resulting in an 88.56% improvement in 99th percentile latency and a 7.86% enhancement in CPU utilization.",
      "Developed features for generating and downloading reports across multiple products, including asynchronous report links and file uploads to S3.",
      "Pioneered Digma AI adoption for continuous feedback, enhancing developer efficiency through real-time code observability in the IDE.",
      "Enabled in-house processing of credit/debit card transactions through direct integration with the Mastercard Integrated Gateway Service (MIGS), eliminating reliance on third-party gateways.",
      "As DRI for Slow Queries, drove a 62% improvement in delayed settlement dashboard performance and a 99.81% enhancement in the Payment Link dashboard while spearheading initiatives to reduce slow queries across multiple domains, including improving query performance related to Virtual Accounts by 75%."
    ]
  },
  {
    "title": "Software Engineer, Intern",
    "company": "Tokopedia",
    "location": "Jakarta",
    "period": "February 2022 - August 2022",
    "icon": "/tokopedia.png",
    "description": [
      "Improved data promo insertion process by 500%",
      "Implemented comprehensive monitoring systems using Grafana, NewRelic, and Datadog",
      "Enhanced backend efficiency using Golang concurrency and managed database migrations",
      "Developed internal tools and achieved 3rd place in Internal Tokopedia Tribe Hackathon"
    ]
  },
  {
    "title": "Lead Mobile Developer",
    "company": "RISTEK UI",
    "location": "Jakarta",
    "period": "March 2021 - March 2022",
    "icon": "https://i.ibb.co.com/nSngMqQ/ristek.jpg",
    "description": [
      "Led weekly Flutter lectures as a mentor",
      "Headed the Backend Team for the Mobdev final project",
      "Coordinated multiple projects valued at approximately 100 million rupiahs",
      "Focused on mobile development education and project management"
    ]
  },
  {
    "title": "Software Engineer, Intern",
    "company": "Sayurbox",
    "location": "Jakarta",
    "period": "June 2021 - September 2021",
    "icon": "https://i.ibb.co.com/pjRTztyB/sayurbox.jpg",
    "description": [
      "Enhanced payment integrations with OVO and Oy",
      "Implemented security measures for payment callbacks",
      "Set up monitoring systems with Kibana and Grafana",
      "Developed endpoints using Spring Boot and managed deployments through Jenkins"
    ]
  },
  {
    "title": "Software Engineer, Intern",
    "company": "Pinhome",
    "location": "Jakarta",
    "period": "December 2020 - May 2021",
    "icon": "https://i.ibb.co.com/67dLSJ6z/pinhome.png",
    "description": [
      "Developed UI for service provider mobile app serving over 1,600 users",
      "Improved customer order allocation by 87%",
      "Created internal data interaction tools",
      "Won 1st place in Internal Pinhome Hackathon (Pinhackathon)"
    ]
  }
]