[
  {
    "title": "Maktour Landing Page & CMS",
    "description": "A landing page and content management system (CMS) for Maktour, enabling all content to be managed from the backend. Built with React for the frontend, Strapi as the headless CMS, AWS S3 for media storage, and AWS SES for email services. This solution streamlines content updates and provides robust infrastructure for scalability and reliability.",
    "images": [
      "/projects/maktour/maktour-1.png",
      "/projects/maktour/maktour-2.png",
      "/projects/maktour/maktour-3.png",
      "/projects/maktour/maktour-4.png",
      "/projects/maktour/maktour-5.png"
    ],
    "technologies": [
      "React",
      "Strapi",
      "AWS S3",
      "AWS SES"
    ],
    "liveUrl": "https://maktour.id/"
  },
  {
    "title": "Susun Jadwal UI",
    "description": "SusunJadwal is a web platform designed to help University of Indonesia students plan their course schedules each semester. With over 200,000 users, SusunJadwal is the top choice for students seeking a streamlined, collaborative course scheduling experience.",
    "images": [
      "/projects/susun-jadwal/susun-jadwal.png"
    ],
    "technologies": [
      "React.js",
      "Flask",
      "MongoDB",
      "AWS",
      "SSO UI"
    ],
    "liveUrl": "https://susunjadwal.cs.ui.ac.id/"
  },
  {
    "title": "UlasKelas - Ristek CS UI",
    "description": "UlasKelas is a mobile app that provides students with detailed course reviews at Fasilkom UI, helping them make informed course selections. With easy SSO login, students can access insights on course content, credits, and prerequisites, eliminating the guesswork in course selection.",
    "images": [
      "/projects/ulas-kelas/ulas-kelas.png"
    ],
    "technologies": [
      "Flutter",
      "SSO UI",
      "Flask",
      "MongoDB",
      "AWS"
    ],
    "liveUrl": "https://play.google.com/store/apps/details?id=com.ristek.ulaskelas&hl=en"
  },
  {
    "title": "Bruwfier",
    "description": "Bruwfier is the ultimate app for home coffee brewers, offering features for tracking brewing activities, favorite recipes, and seller engagement. The app also includes a CMS for administrators to manage backend data efficiently, enhancing the user experience for coffee enthusiasts.",
    "images": [
      "/projects/bruwfier/icon-bruwfier.png",
      "/projects/bruwfier/preview-bruwfier.png"
    ],
    "technologies": [
      "React Native",
      "Firebase Firestore",
      "NestJs"
    ],
    "liveUrl": "https://play.google.com/store/apps/details?id=com.bruwfier&hl=id"
  },
  {
    "title": "World Cancer Day - RSCM",
    "description": "The World Cancer Day website raises awareness about cancer, focusing on education, early detection, and equitable treatment access. It includes campaigns, resources, and ways to engage in supporting cancer prevention and research.",
    "images": [
      "/projects/world-cancer-day/world-cancer-day-2.png",
      "/projects/world-cancer-day/world-cancer-day-1.png"
    ],
    "technologies": [
      "Laravel",
      "PostgreSQL",
      "Vue.js"
    ]
  },
  {
    "title": "Logbook Anestesi UI",
    "description": "Logbook App for the Faculty of Medicine, Universitas Indonesia. For faster development, I've integrated some features as Web Views. For the Flutter side, I'm utilizing Cubit for state management and implementing separation of concerns for improved readability and maintainability. On the web side, we are using React with Typescript, implementing React Context for state management, and utilizing the Chakra-UI component library.",
    "images": [
      "icon-logbook-anestesi.png",
      "/projects/logbook/logbook-1.png",
      "/projects/logbook/logbook-2.png",
      "/projects/logbook/logbook-3.png",
      "/projects/logbook/logbook-4.png",
      "/projects/logbook/logbook-5.png"
    ],
    "technologies": [
      "Flutter",
      "React",
      "Typescript",
      "Cubit"
    ]
  },
  {
    "title": "PHR Fasilkom UI",
    "description": "A comprehensive website designed to record and monitor individual medical activities. The platform includes features for ongoing health tracking and an extensive medical history record. Users can also search for healthcare facilities in specific locations, making it easy to access relevant health services nearby. This tool is ideal for personal health management and accessing care resources efficiently.",
    "images": [
      "icon-phr.png",
      "/projects/phr/phr-1.png",
      "/projects/phr/phr-2.png",
      "/projects/phr/phr-3.png",
      "/projects/phr/phr-4.png"
    ],
    "technologies": [
      "Flutter",
      "Cloud",
      "Docker"
    ],
    "liveUrl": "https://phr-fasilkom.netlify.app/"
  },
  {
    "title": "LawanCovid",
    "description": "LawanCovid is a mobile app with features to support users during the COVID-19 pandemic, including a Convalescent Plasma Portal, Health Articles, a COVID-19 Assessment Calendar, and area statistics for Indonesia.",
    "images": [
      "icon-lawan-covid.png",
      "/projects/lawan-covid/lawan-covid-1.png",
      "/projects/lawan-covid/lawan-covid-2.png",
      "/projects/lawan-covid/lawan-covid-3.png",
      "/projects/lawan-covid/lawan-covid-4.png"
    ],
    "technologies": [
      "Flutter",
      "SpringBoot",
      "Firebase Firestore"
    ],
    "liveUrl": "http://bit.ly/VideoLawanCovid"
  },
  {
    "title": "RAC Landing Page with CMS",
    "description": "A modern website revamp for Relevance and Alliance Capital, featuring a content management system (CMS) similar to the Maktour project. Built with React for the frontend, Strapi as the headless CMS, AWS S3 for media storage, and Brevo for email services. This solution enables seamless content updates and robust infrastructure for scalability.",
    "images": [
      "/projects/rac/rac-1.png",
      "/projects/rac/rac-2.png",
      "/projects/rac/rac-3.png"
    ],
    "technologies": [
      "React",
      "Strapi",
      "AWS S3",
      "Brevo"
    ]
  },
  {
    "title": "SIPRO",
    "description": "SIPRO is a comprehensive procurement information system tailored for Citius. It integrates all parties involved in procurement and provides real-time data management, covering subcontractor data, purchase requests, purchase orders, invoices, payments, and approvals. SIPRO streamlines the procurement process, supporting Citius' core operations with efficiency and integration.",
    "images": [
      "/projects/sipro/sipro-1.png",
      "/projects/sipro/sipro-2.png",
      "/projects/sipro/sipro-3.png"
    ],
    "technologies": [
      "Django",
      "AWS"
    ],
    "liveUrl": "https://citius.co.id/"
  },
  {
    "title": "CLICK",
    "description": "CLICK is a mobile platform connecting consumers with various on-demand services, from catering and laundry to logistics and souvenirs. This project developed CLICK's company profile, highlighting its features and mission to revolutionize on-demand services.",
    "images": [
      "/projects/click/click-1.png",
      "/projects/click/click-2.png"
    ],
    "technologies": [
      "Laravel"
    ]
  }
]